

//////////////////////
//// EJEMPLOS DE CONFIGURACION DE REDES
//////////////////////

/////////////////CONFIGURACION DEL PRIMER ROUTER
enable
configure terminal
interface FastEthernet0/0
ip address 192.168.0.1 255.255.255.0
no shutdwown
exit
interface Serial3/0
ip address 10.0.0.1 255.0.0.0
ip route 192.168.1.0 255.255.255.0 10.0.0.2 


copy running-config startup-config  //sirve para guardar la configuracion del router
show version    //para ver la version del route y su informacion
show interface gigabitEthernet 0/0    //para mostrar la informacion referente a esa interface
show interface        //muestra las estadísticas para todas las interfaces configuradas en el router
show ip route   //ver la configuracion ip del router  C: red L:interfaz .. examenes asi
show ipv6 interface brief  //muestra un breve resumen de las interfaces, los estados y las direcciones IP actualmente asignadas a ellas
show ip interface brief   //muestra la mascara
arp -a
show ip arp
description LAN connection to S1  //Configure una descripción de la interfaz que indique a qué dispositivo está conectada
netstat -r          //se puede usar para mostrar la tabla de enrutamiento del host

/////////////////CONFIGURACION DEL SEGUNDO ROUTER
enable
configure terminal
interface FastEthernet0/0
ip address 192.168.1.1 255.255.255.0
no shutdwown
exit
interface Serial2/0
ip address 10.0.0.1 255.0.0.0
ip route 192.168.0.0 255.255.255.0 10.0.0.1 




////////////////////////////////PARCIAL 3

int gig0/0
ip address 192.168.1.130 255.255.255.224
no shutdwown

int gig0/1
ip address 192.168.1.164 255.255.255.240
no shutdwown

ipv6 unicast-routing
int gig0/0
ipv6 address 2001:db8:acad:a::1/64
ipv6 address fe80::1 link-local 

ipv6 unicast-routing
int gig0/1
ipv6 address 2001:db8:acad:b::1/64
ipv6 address fe80::1 link-local 

interface vlan 1 
ip address 192.168.1.163 255.255.255.240 


hostname Middle   //ROUTER
service password-encryption
security password min-length 10
username netadmin secret Cisco_CCNA5  //crear usuario y contraseña
crypto key generate rsa    //1024 
no ip domain-lookup    //desactiva las busquedas de dns
line console 0 4    //ingresamos a console 0
transport input ssh   //establecemos transporte por ssh
login local      //login
copy running-config startup-config 








///////////////CONFIGURAR VLAN EN SWITCH Y VLAN
enable secret class  //programamos la contraseña del enable
line console 0
password cisco
login
line vty 0 4
password cisco
login
service password-encryption
interface vlan 1  //se escoje el nombre de la vlan
ip address 192.168.1.12 255.255.255.0
no shu
vlan 1
name Operations
show vlan brief  //ver la lista de vlan y sus nombres

//se le asigna a esta interface la vlan 10
S1(config)# interface f0/6 
S1(config-if)# switchport mode access
S1(config-if)# switchport access vlan 10  
no shu


S1(config)# interface range f0/2-5, f0/7-24, g0/1-2
S1(config-if-range)# switchport mode access
S1(config-if-range)# switchport access vlan 999
S1(config-if-range)# shutdown

//se transfiere la direccion ip del switch a la VLAN99
S1(config)# interface vlan 1 
S1(config-if)# no ip address 
S1(config-if)# interface vlan 99  
S1(config-if)# ip address 192.168.1.11 255.255.255.0
S1(config-if)# end

//Se elimina una Vlan de una interface
S1(config)# interface f0/24
S1(config-if)# no switchport access vlan
S1(config-if)# end

//Se elimina la vlan pero los puertos quedan inactivos
S1(config)# no vlan 30
S1(config)# end

//configurar una interface en elace troncal, 
//esto es necesario para que 2 switch con VLAN igual (VLAN1) se puedan comunicar
S1(config)# interface f0/1
S1(config-if)# switchport mode dynamic desirable
show interfaces trunk
S1(config)# interface f0/1
S1(config-if)# switchport mode trunk  //802.1q se usa para configurar de forma manual la troncal y se debe hacer en los 2 extremos de comunicacion

//Cambiar la configracion troncal de ambos switch de VLAN1 a VLAN1000
S1(config)# interface f0/1
S1(config-if)# switchport trunk native vlan 1000

//Cambia el modo de switchport en la interfaz F0/1 para forzar el enlace troncal
S1(config)# interface f0/1
S1(config-if)# switchport mode trunk
S1(config-if)# switchport trunk native vlan 1000  //establece la vlan nativa 1000
S1(config-if)# switchport trunk allowed vlan 10,20,30,1000  // especifica que esas vlan pueden pasar por la troncal

//Sirve para poner encapsulado 802.1Q y asignarle la Vlan10 a la subinterface 0.10
R1(config)# int g0/0.10
R1(config-subif)# encapsulation dot1Q 10
R1(config-subif)# ip address 172.17.10.1 255.255.255.0

ipv6 unicast-routing  //habilitar el enrutamiento ipv6
erase startup-config  //Para obtener una copia de cambio de su configuracion predeterminada
delete vlan.dat   //eliminar vlan
show interface g0/1.10
show interface trunk

//Configuracion de Etherchannel
S1(config)#int range f0/21-22
S1(config-if-range)#switchport mode trunk
S1(config)# interface range f0/21 – 22
S1(config-if-range)# shutdown
S1(config-if-range)# channel-group 1 mode desirable
S1(config-if-range)# no shutdown
S1(config)# interface port-channel 1
S1(config-if)# switchport mode trunk
S1(config)# spanning-tree vlan 1 priority 24576






